wstars1994/nes-simulator/nes_c_stm32/Core/Src/nes.c
                int addr = ams_zero(data,c_reg_x);
                data2 = read(addr) - 1;
                write(addr,data2);
                set_nz(data2);
                cpu_cycle-=6;
                break;
            default:
                cpu_cycle-=0;
                printf("unknown ins %X\n",opc&0xFF);
                break;
        }
        //printf("\n");
    }
}

void coarseY(){
    if (showBg()||showSpr()) {
        // if fine Y < 7
        if ((p_vram_addr & 0x7000) != 0x7000) {
            // increment fine Y
            p_vram_addr += 0x1000;
        }else{
            // fine Y = 0
            p_vram_addr &= ~0x7000;
            // let y = coarse Y
            int y = (p_vram_addr & 0x03E0) >> 5;
            if (y == 29){
                // coarse Y = 0
                y = 0;
                // switch vertical nametableelse if (y == 31)
                p_vram_addr ^= 0x0800;
            }else if (y == 31) {
                // coarse Y = 0, nametable not switched
                y = 0;
            }else{
                // increment coarse Y
                y += 1;
            }
            // put coarse Y back into v
            p_vram_addr = (p_vram_addr & ~0x03E0) | (y << 5);
        }
    }
}

void NES_Start() {
    uint8_t n = *(__IO uint8_t*)(0x08020000);
    uint8_t e = *(__IO uint8_t*)(0x08020001);
    uint8_t s = *(__IO uint8_t*)(0x08020002);
    printf("%c",n);
    printf("%c",e);
    printf("%c\n",s);
    int rom_prg_size = *(__IO uint8_t*)(0x08020004);
    int rom_chr_size = *(__IO uint8_t*)(0x08020005);

    program_length = 16 * 1024 * rom_prg_size;
    int chr_length = 8 * 1024 * rom_chr_size;
    printf("rom_prg_size:%d\nrom_chr_size:%d\n",program_length,chr_length);

    LCD_SetRegion(30,0,255+30,LCD_HEIGHT);
    LL_DMA_ConfigAddresses(DMA2,LL_DMA_STREAM_2,(uint32_t)&render, LL_SPI_DMA_GetRegAddr(SPI1),LL_DMA_GetDataTransferDirection(DMA2, LL_DMA_STREAM_2));
    LL_DMA_SetDataLength(DMA2, LL_DMA_STREAM_2, 256*120);
    while (1) {
        for (int l = 0; l < 240; l++) {
            if(showBg() || showSpr()){
                p_vram_addr = (p_vram_addr & 0xfbe0) | (p_vram_temp_addr & 0x041f);
            }
            ppu_render(l);
            exec_instruction();
            coarseY();
        }
        if(showBg() || showSpr()) {
            LCD_CS_CLR
            LCD_DC_SET
            for (int i = 0; i < 2; ++i) {
                render_name_table(i);
                LL_DMA_EnableStream(DMA2, LL_DMA_STREAM_2);
                LL_mDelay(10);
            }
            LCD_CS_SET;
        }
        //设置vblank true
        set_bit(&p_reg_2002,1,7);
        set_bit(&p_reg_2002,0,6);
        exec_instruction();
        //NMI中断
        interrupt_nmi();
        //242-260
        for (int i = 242; i < 262; i++) {
            exec_instruction();
        }
        set_bit(&p_reg_2002,0,7);
        //vblank结束后 如果有渲染 将t复制到v
        if(showBg()||showSpr()){
            p_vram_addr = p_vram_temp_addr;
        }
    }
}